antfu.iconify
antfu.open-in-github-button
anthonyattard.zoomer
atommaterial.a-file-icon-vscode
austenc.tailwind-docs
bradlc.vscode-tailwindcss
burkeholland.simple-react-snippets
christian-kohler.path-intellisense
csstools.postcss
dbaeumer.vscode-eslint
eamodio.gitlens
ekstasis.vscode-color-picker-hex
emmanuelbeziat.vscode-great-icons
esbenp.prettier-vscode
eserozvataf.one-dark-pro-monokai-darker
fabiospampinato.vscode-open-in-github
formulahendry.auto-rename-tag
formulahendry.code-runner
gutterstyle.iconic
hediet.vscode-drawio
kamikillerto.vscode-colorize
kisstkondoros.vscode-gutter-preview
leetcode.vscode-leetcode
mechatroner.rainbow-csv
melishev.feather-vscode
ms-playwright.playwright
ms-python.debugpy
ms-python.python
ms-vscode.powershell
pinkcodes.pinkcodes
pkief.material-icon-theme
pnp.polacode
ritwickdey.liveserver
sdras.vue-vscode-snippets
shd101wyy.markdown-preview-enhanced
tal7aouy.icons
tomoki1207.pdf
usernamehw.errorlens
vitest.explorer
vue.volar
wayou.vscode-todo-highlight
wix.vscode-import-cost
xabikos.javascriptsnippets
zhuangtongfa.material-theme

cat vscode-extensions.txt | % { code --install-extension $_ }
